# Задание1
name = input('Введите Ваше имя ')
phone = input('Введите номер телефона ')
klient = name + ' ' + ' телефон: ' + phone
print('Данные клиента: Имя:' + klient)